chrisc11/memfault_saml1x_proto/Packs/atmel/SAML10_DFP/1.0.158/Atmel.SAML10_DFP.pdsc
      <component Cvendor="Atmel" Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="ATSAML10E15A">
         <description>Headers and startup code for Atmel ATSAML10E15A</description>
         <files>
            <file condition="C" category="include" name="include"/>
            <file condition="C" category="header" name="include/sam.h"/>
            <file condition="C Exe" category="source" name="templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="gcc/gcc/startup_saml10e15a.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="gcc/system_saml10e15a.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="gcc/gcc/saml10e15a_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="gcc/gcc/saml10e15a_sram.ld" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/iar/startup_saml10e15a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/system_saml10e15a.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="iar/config/linker/Microchip/atsaml10e15a/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="iar/config/linker/Microchip/atsaml10e15a/flash.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel" Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="ATSAML10E16A">
         <description>Headers and startup code for Atmel ATSAML10E16A</description>
         <files>
            <file condition="C" category="include" name="include"/>
            <file condition="C" category="header" name="include/sam.h"/>
            <file condition="C Exe" category="source" name="templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="gcc/gcc/startup_saml10e16a.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="gcc/system_saml10e16a.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="gcc/gcc/saml10e16a_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="gcc/gcc/saml10e16a_sram.ld" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/iar/startup_saml10e16a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/system_saml10e16a.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="iar/config/linker/Microchip/atsaml10e16a/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="iar/config/linker/Microchip/atsaml10e16a/flash.icf" attr="config"/>
         </files>
      </component>
   </components>
</package>
